accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/customers/GetCustomer-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/AccountManagement/GetCustomer">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetCustomerResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:ListOfAccounts>
                  <!--Zero or more repetitions:-->
                  <get:Accounts>
                     <!--Optional:-->
                     <get:AccountCode>?</get:AccountCode>
                     <!--Optional:-->
                     <get:AccountName>?</get:AccountName>
                     <!--Optional:-->
                     <get:ArabicName>?</get:ArabicName>
                     <!--Optional:-->
                     <get:IntegrationId>?</get:IntegrationId>
                     <!--Optional:-->
                     <get:Segment>?</get:Segment>
                     <!--Optional:-->
                     <get:StreetName>?</get:StreetName>
                     <!--Optional:-->
                     <get:Unit>?</get:Unit>
                     <!--Optional:-->
                     <get:POBox>?</get:POBox>
                     <!--Optional:-->
                     <get:Area>?</get:Area>
                     <!--Optional:-->
                     <get:City>?</get:City>
                     <!--Optional:-->
                     <get:Emirate>?</get:Emirate>
                     <!--Optional:-->
                     <get:Country>?</get:Country>
                     <!--Optional:-->
                     <get:Email>?</get:Email>
                     <!--Optional:-->
                     <get:ContactId>?</get:ContactId>
                     <!--Optional:-->
                     <get:PhoneNumber>?</get:PhoneNumber>
                     <!--Optional:-->
                     <get:ActiveMobileCounter>?</get:ActiveMobileCounter>
                     <!--Optional:-->
                     <get:DateOfBirth>?</get:DateOfBirth>
                     <!--Optional:-->
                     <get:RecurringPayment>?</get:RecurringPayment>
                     <!--Optional:-->
                     <get:MonthlyIncome>?</get:MonthlyIncome>
                     <!--Optional:-->
                     <get:Id>?</get:Id>
                     <!--Optional:-->
                     <get:ParentAccountId>?</get:ParentAccountId>
                     <!--Optional:-->
                     <get:AccountLevel>?</get:AccountLevel>
                     <!--Optional:-->
                     <get:AccountLevelCode>?</get:AccountLevelCode>
                     <!--Optional:-->
                     <get:AccountStatus>?</get:AccountStatus>
                     <!--Optional:-->
                     <get:Nationality>?</get:Nationality>
                     <!--Optional:-->
                     <get:DocumentNumber>?</get:DocumentNumber>
                     <!--Optional:-->
                     <get:DocumentType>?</get:DocumentType>
                     <!--Optional:-->
                     <get:DocumentNumberIssueDate>?</get:DocumentNumberIssueDate>
                     <!--Optional:-->
                     <get:DocumentNumberExpiryDate>?</get:DocumentNumberExpiryDate>
                     <!--Optional:-->
                     <get:BillingContact>
                        <!--Optional:-->
                        <get:Title>?</get:Title>
                        <!--Optional:-->
                        <get:VisaType>?</get:VisaType>
                        <!--Optional:-->
                        <get:VisaExpiryDate>?</get:VisaExpiryDate>
                        <!--Optional:-->
                        <get:VisaNumber>?</get:VisaNumber>
                        <!--Optional:-->
                        <get:Gender>?</get:Gender>
                        <!--Optional:-->
                        <get:AbsherId>?</get:AbsherId>
                        <!--Optional:-->
                        <get:UnifiedNumber>?</get:UnifiedNumber>
                        <!--Optional:-->
                        <get:BillingFirstName>?</get:BillingFirstName>
                        <!--Optional:-->
                        <get:BillingLastName>?</get:BillingLastName>
                        <!--Optional:-->
                        <get:AccountFullName>?</get:AccountFullName>
                     </get:BillingContact>
                     <!--Optional:-->
                     <get:ListOfContracts>
                        <!--Zero or more repetitions:-->
                        <get:Contracts>
                           <!--Optional:-->
                           <get:ContractCode>?</get:ContractCode>
                           <!--Optional:-->
                           <get:ContractType>?</get:ContractType>
                           <!--Optional:-->
                           <get:Resource>?</get:Resource>
                           <!--Optional:-->
                           <get:Status>?</get:Status>
                           <!--Optional:-->
                           <get:ProductIntegrationId>?</get:ProductIntegrationId>
                           <!--Optional:-->
                           <get:BillingStatus>?</get:BillingStatus>
                        </get:Contracts>
                     </get:ListOfContracts>
                  </get:Accounts>
               </get:ListOfAccounts>
               <!--Optional:-->
               <get:Customer>
                  <!--Optional:-->
                  <get:CustomerId>?</get:CustomerId>
                  <!--Optional:-->
                  <get:Title>?</get:Title>
                  <!--Optional:-->
                  <get:Name>?</get:Name>
                  <!--Optional:-->
                  <get:DocumentType>?</get:DocumentType>
                  <!--Optional:-->
                  <get:DocumentNumber>?</get:DocumentNumber>
                  <!--Optional:-->
                  <get:Nationality>?</get:Nationality>
                  <!--Optional:-->
                  <get:DocumentIssueDate>?</get:DocumentIssueDate>
                  <!--Optional:-->
                  <get:DocumentExpiryDate>?</get:DocumentExpiryDate>
                  <!--Optional:-->
                  <get:VisaType>?</get:VisaType>
                  <!--Optional:-->
                  <get:VisaExpiryDate>?</get:VisaExpiryDate>
                  <!--Optional:-->
                  <get:VisaNumber>?</get:VisaNumber>
                  <!--Optional:-->
                  <get:Gender>?</get:Gender>
                  <!--Optional:-->
                  <get:Language>?</get:Language>
                  <!--Optional:-->
                  <get:DateOfBirth>?</get:DateOfBirth>
                  <!--Optional:-->
                  <get:ContactId>?</get:ContactId>
                  <!--Optional:-->
                  <get:AbsherId>?</get:AbsherId>
                  <!--Optional:-->
                  <get:UnifiedNumber>?</get:UnifiedNumber>
                  <!--Optional:-->
                  <get:MonthlyIncome>?</get:MonthlyIncome>
                  <!--Optional:-->
                  <get:Recurringpayment>?</get:Recurringpayment>
                  <!--Optional:-->
                  <get:ID>?</get:ID>
                  <!--Optional:-->
                  <get:CompanyName>?</get:CompanyName>
                  <!--Optional:-->
                  <get:NatureOfBusiness>?</get:NatureOfBusiness>
                  <!--Optional:-->
                  <get:NumberOfEmployees>?</get:NumberOfEmployees>
                  <!--Optional:-->
                  <get:Type>?</get:Type>
                  <!--Optional:-->
                  <get:Segment>?</get:Segment>
               </get:Customer>
            </lcew:Body>
         </Response>
      </web:GetCustomerResponse>
   </soapenv:Body>
</soapenv:Envelope>